-- phpMyAdmin SQL Dump
-- version 4.0.10.10
-- http://www.phpmyadmin.net
--
-- Host: 127.6.53.2:3306
-- Erstellungszeit: 17. Aug 2015 um 11:04
-- Server Version: 5.5.41
-- PHP-Version: 5.3.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Datenbank: `ling`
--

--
-- Daten für Tabelle `site_text`
--

INSERT INTO `site_text` (`id`, `lang`, `val`) VALUES
('about', 'uk', 
'<p><b>Основна мета проекту</b> — створення якісних та зручних у використанні онлайн-словників для перекладу
з та на українську мову. Редагувати дані словників можуть всі зареєстровані користувачі. Принцип досить схожий на Вікіпедію.
Бажаючі вивчати іноземні мови можуть скористатися різноманітними інструментами, які використовують дані словників.
Детальніше про ці інструменти можна почитати нижче.
</p> 
<hr/>
<h2>Що я можу тут робити?</h2>
<p>Якщо ви вивчаєте німецьку чи англійську мови, читаєте книги написані цими мовами і втомилися постійно заглядати в словник,
то, можливо, вас зацікавлять можливості які надає цей сайт.    
</p>
<p>Перш за все потрібно створити свій обліковий запис, без нього неможливо ефективно користуватися основними інструментами.   
</p>
<p>Починати варто з інструменту ''<b>Вивчені слова</b>'', де можна відмітити відомі вам слова. Далі, за допомогою інструменту ''<b>Навчальні тексти</b>'',
можна будь-який текст доповнити зносками з перекладами невідомих вам слів, зберегти в форматі fb2 й читати за допомогою програми CoolReader3 на
вашому улюбленому пристрої. 
</p>
<p>Проект розвивається і потребує зворотнього зв''язку, тому не соромтеся надсилати ваші відгуки, поради, побажання чи пропозиції.
</p>
<hr/>
<h2>Короткий опис інструментів та функцій</h2>
<p><b>Створення облікового запису (реєстрація).</b> Для перегляду словників реєстрація не потрібна,
але для редагування словників і доступу до більшості інструментів необхідно створити обліковий запис.
Для цього необхідно ввести ім''я, під яким ви хочете зареєструватись, адресу електронної пошти та пароль.
Після цього на вашу електронну пошту надійде лист з проханням підтвердити реєстрацію. Цей лист часто розпізнається як
спам, тому будьте уважні. Після підтвердження реєстрації ви отримаєте доступ до всіх наявних інструментів.
</p>
<p><b>Cловники.</b> Зареєстровані користувачі можуть редагувати словники.
На даний момент доступні англійсько-український та німецько-український словники.
Редагуючи словники намагайтеся дотримуватися словникового стилю, бути конструктивними й покращувати словники.
Майте на увазі, що за деструктивні дії користувача може бути заблоковано. 
</p>
<p><b>Вивчені слова.</b> Цей інструмент надає користувачу можливість позначати вже вивчені слова певного словника.
Дані про вже вивчені слова використовуються інструментом ''Навчальні тексти''.
Детальніший опис знаходиться в закладці ''Допомога'' інструменту ''Вивчені слова''.
<b>Незареєстровані користувачі не можуть використовувати цей інструмент.</b> 
</p>
<p><b>Навчальні тексти.</b> Підготовка тексту за допомогою обраного словника.
Детальніший опис знаходиться в закладці ''Допомога'' інструменту ''Навчальні тексти''.
</p>
<p><b>Тест словникового запасу</b> допоможе вам оцінити ваш словниковий запас англійською чи німецькою мовами.
Тест складається з двох частин: грубої оцінки та уточнення. В обох частинах необхідно поставити галочки біля відомих вам слів.
</p>
<p><b>Паралельні тексти.</b> Підготовка таблиці з паралельним текстом на основі оригінального тексту та його перекладу.
Наразі підтримуються лише українська та англійська мови.
Детальніший опис знаходиться в закладці ''Допомога'' утиліти ''Паралельні тексти''.
</p>');

INSERT INTO `site_text` (`id`, `lang`, `val`) VALUES
('dict_list', 'uk', 
'<h2>Список українських онлайн-словників</h2>
<p>
<ul>
<li>Вікісловник - https://uk.wiktionary.org/
</li>
<li>Словники України on-line (морфологічний словник: словозміна, синонімія, фразеологія) - http://lcorp.ulif.org.ua/dictua/
</li>
<li>Багатомовний словник з можливістю редагування. Компіляція даних з багатьох джерел - https://uk.glosbe.com/
</li>
Польсько-український електронний словник - http://www.domeczek.pl/~polukr/pus/index_ua.php
 Українсько-англійський словник - http://e2u.org.ua/
словоформи (орфографічний словник) для більше ніж 260 000 слів - http://slovnyk.ua/
http://uk.worldwidedictionary.org
</ul>
</p>');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
